---
kind: type
id: T:Autodesk.Revit.Exceptions.ResourceNotFoundException
source: html/4ef7bcee-5831-e2c9-ee4a-06a0dd6c255f.htm
---
# Autodesk.Revit.Exceptions.ResourceNotFoundException

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ResourceNotFoundException : ApplicationException
```